#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.service_records["api"].dnsimple_zone_record.consul_service_records["$nameA$addressvegan.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id             = (known after apply)
      + name           = "api"
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = 1800
      + type           = "A"
      + value          = "172.17.0.1"
      + zone_id        = (known after apply)
      + zone_name      = "vegan.pizza"
    }

  # module.service_records["web_1"].dnsimple_zone_record.consul_service_records["web.devA127.0.0.1vegan.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id             = (known after apply)
      + name           = "web.dev"
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = 60
      + type           = "A"
      + value          = "127.0.0.1"
      + zone_id        = (known after apply)
      + zone_name      = "vegan.pizza"
    }

  # module.service_records["web_2"].dnsimple_zone_record.consul_service_records["$nameSRV10 10 $port $addressvegan.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id             = (known after apply)
      + name           = "web"
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = 3600
      + type           = "SRV"
      + value          = "10 10 5000 172.17.0.3"
      + zone_id        = (known after apply)
      + zone_name      = "vegan.pizza"
    }

  # module.service_records["web_3"].dnsimple_zone_record.consul_service_records["$name.internal-secondaryA$addressmeatlover.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id             = (known after apply)
      + name           = "web.internal-secondary"
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = 3600
      + type           = "A"
      + value          = "172.17.0.3"
      + zone_id        = (known after apply)
      + zone_name      = "meatlover.pizza"
    }

  # module.service_records["web_3"].dnsimple_zone_record.consul_service_records["$name.internalA$node_addressmeatlover.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id             = (known after apply)
      + name           = "web.internal"
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = 3600
      + type           = "A"
      + value          = "192.168.10.11"
      + zone_id        = (known after apply)
      + zone_name      = "meatlover.pizza"
    }

  # module.service_records["web_3"].dnsimple_zone_record.consul_service_records["$nameSRV10 $port $name.internal.vegan.pizzavegan.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id             = (known after apply)
      + name           = "web"
      + priority       = 10
      + qualified_name = (known after apply)
      + ttl            = 3600
      + type           = "SRV"
      + value          = "10 5000 web.internal.vegan.pizza"
      + zone_id        = (known after apply)
      + zone_name      = "vegan.pizza"
    }

  # module.service_records["web_3"].dnsimple_zone_record.consul_service_records["mailMX$name.internal.vegan.pizzameatlover.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id             = (known after apply)
      + name           = "mail"
      + priority       = 10
      + qualified_name = (known after apply)
      + ttl            = 3600
      + type           = "MX"
      + value          = "web.internal.vegan.pizza"
      + zone_id        = (known after apply)
      + zone_name      = "meatlover.pizza"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + service_records = {
      + api   = {
          + defaults           = {
              + record_ttl  = 1800
              + record_type = "A"
              + zone_name   = "vegan.pizza"
            }
          + service_record_map = [
              + "vegan.pizza:api:A:1800:172.17.0.1",
            ]
        }
      + web_1 = {
          + defaults           = {
              + record_ttl  = 3600
              + record_type = "A"
              + zone_name   = null
            }
          + service_record_map = [
              + "vegan.pizza:web.dev:A:60:127.0.0.1",
            ]
        }
      + web_2 = {
          + defaults           = {
              + record_ttl  = 3600
              + record_type = "A"
              + zone_name   = null
            }
          + service_record_map = [
              + "vegan.pizza:web:SRV:3600:10 10 5000 172.17.0.3",
            ]
        }
      + web_3 = {
          + defaults           = {
              + record_ttl  = 3600
              + record_type = "A"
              + zone_name   = "meatlover.pizza"
            }
          + service_record_map = [
              + "meatlover.pizza:web.internal-secondary:A:3600:172.17.0.3",
              + "meatlover.pizza:web.internal:A:3600:192.168.10.11",
              + "vegan.pizza:web:SRV:3600:10 5000 web.internal.vegan.pizza",
              + "meatlover.pizza:mail:MX:3600:web.internal.vegan.pizza",
            ]
        }
    }

Warning: Experimental feature "module_variable_optional_attrs" is active

  on modules/service-records/main.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @DXTimer, Action: `pull_request`*